<?php

return [

    /*
    |--------------------------------------------------------------------------
    | اسم الطابعة الحرارية الافتراضية
    |--------------------------------------------------------------------------
    */

    'thermal_printer' => env('THERMAL_PRINTER_NAME', 'Xprinter XP-Q371U'),


    /*
    |--------------------------------------------------------------------------
    | عرض الطابعة (بالأحرف) - غير مستخدم مباشرة لكن كملاحظة
    |--------------------------------------------------------------------------
    */

    'paper_width' => env('THERMAL_PAPER_WIDTH', 48),

    /*
    |--------------------------------------------------------------------------
    | إعدادات الباركود (لإنشاء صورة الباركود PNG)
    |--------------------------------------------------------------------------
    */

    'barcode' => [
        'type' => 'C128',          // نوع الباركود (Code 128)
        'width' => 2,              // عرض البار (Bar Width)
        'height' => 50,            // ارتفاع الباركود (Bar Height)
    ],

];