-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Nov 10, 2025 at 06:50 PM
-- Server version: 8.0.30
-- PHP Version: 8.4.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `pos-clothes`
--

-- --------------------------------------------------------

--
-- Table structure for table `product_variants`
--

CREATE TABLE `product_variants` (
  `id` bigint UNSIGNED NOT NULL,
  `product_id` bigint UNSIGNED DEFAULT NULL,
  `supplier_id` bigint UNSIGNED DEFAULT NULL,
  `sku` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `barcode` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `color` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `size` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `cost` decimal(10,2) NOT NULL DEFAULT '0.00',
  `price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `stock_qty` int NOT NULL DEFAULT '0',
  `reorder_level` int NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_low_stock` tinyint(1) GENERATED ALWAYS AS ((`stock_qty` < `reorder_level`)) STORED
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_variants`
--

INSERT INTO `product_variants` (`id`, `product_id`, `supplier_id`, `sku`, `barcode`, `color`, `size`, `cost`, `price`, `stock_qty`, `reorder_level`, `created_at`, `updated_at`, `name`) VALUES
(1, NULL, NULL, '102', '102', '--', '40', 214.00, 270.00, 4, 1, '2025-11-09 15:10:44', '2025-11-09 15:30:08', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(2, NULL, NULL, '103', '103', '--', '38', 208.00, 260.00, 6, 1, '2025-11-09 15:34:29', '2025-11-09 15:34:29', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(3, NULL, NULL, '104', '104', NULL, '36', 99.00, 250.00, 5, 1, '2025-11-09 15:43:22', '2025-11-09 16:41:38', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(4, NULL, NULL, '105', '105', NULL, '34', 193.00, 210.00, 6, 1, '2025-11-09 15:50:38', '2025-11-09 15:50:38', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(5, NULL, NULL, '106', '106', NULL, '14', 187.00, 210.00, 6, 1, '2025-11-09 15:53:40', '2025-11-09 15:53:40', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(7, NULL, NULL, '107', '107', NULL, '12', 176.00, 210.00, 6, 1, '2025-11-09 15:58:36', '2025-11-09 15:58:36', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(8, NULL, NULL, '108', '108', NULL, '10', 167.00, 200.00, 6, 1, '2025-11-09 16:00:05', '2025-11-09 16:00:05', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(9, NULL, NULL, '109', '109', NULL, '8', 160.00, 200.00, 6, 1, '2025-11-09 16:03:21', '2025-11-09 16:03:21', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(10, NULL, NULL, '110', '110', NULL, '6', 150.00, 200.00, 6, 1, '2025-11-09 16:05:55', '2025-11-09 16:05:55', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(11, NULL, NULL, '111', '111', NULL, '4', 144.00, 200.00, 6, 1, '2025-11-09 16:10:07', '2025-11-09 16:10:07', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(12, NULL, NULL, '315', '315', NULL, '4', 195.00, 270.00, 6, 1, '2025-11-09 16:19:01', '2025-11-09 16:19:01', 'طقم بوكسر بناتى 3 قطعة اوليف'),
(13, NULL, NULL, '316', '316', NULL, '6', 209.00, 280.00, 6, 1, '2025-11-09 16:20:57', '2025-11-09 16:20:57', 'طقم بوكسر بناتى3 قطعة اوليف'),
(14, NULL, NULL, '317', '317', NULL, '8', 219.00, 290.00, 6, 1, '2025-11-09 16:22:39', '2025-11-09 16:31:32', 'طقم بوكسر بناتى3 قطعة اوليف'),
(15, NULL, NULL, '318', '318', NULL, '10', 231.00, 310.00, 6, 1, '2025-11-09 16:29:28', '2025-11-09 16:29:28', 'طقم بوكسر بناتى3 قطعة اوليف'),
(16, NULL, NULL, '319', '319', NULL, '12', 243.00, 320.00, 6, 1, '2025-11-09 16:34:01', '2025-11-09 16:34:01', 'طقم بوكسر بناتى3 قطعة اوليف'),
(17, NULL, NULL, '320', '320', NULL, '14', 250.00, 330.00, 4, 1, '2025-11-09 16:36:44', '2025-11-09 16:36:44', 'طقم بوكسر بناتى3 قطعة اوليف'),
(18, NULL, NULL, '321', '321', NULL, '34', 267.00, 345.00, 4, 1, '2025-11-09 16:38:27', '2025-11-09 16:38:27', 'طقم بوكسر بناتى3 قطعة اوليف'),
(19, NULL, NULL, '322', '322', NULL, '36', 276.00, 355.00, 4, 1, '2025-11-09 16:39:34', '2025-11-09 16:39:34', 'طقم بوكسر بناتى3 قطعة اوليف'),
(20, NULL, NULL, '323', '323', NULL, '38', 291.00, 370.00, 4, 1, '2025-11-09 16:40:59', '2025-11-09 16:40:59', 'طقم بوكسر بناتى3 قطعة اوليف'),
(21, NULL, NULL, '324', '324', NULL, '40', 302.00, 400.00, 4, 1, '2025-11-09 16:42:44', '2025-11-09 16:42:44', 'طقم بوكسر بناتى3 قطعة اوليف'),
(22, NULL, NULL, '607', '607', NULL, '2XL', 86.00, 115.00, 3, 1, '2025-11-09 16:46:40', '2025-11-09 16:46:40', 'لونج شورت اوليف حريمى'),
(23, NULL, NULL, '606', '606', NULL, '3XL', 88.00, 120.00, 6, 1, '2025-11-09 16:48:18', '2025-11-09 16:48:18', 'لونج شورت اوليف حريمى'),
(24, NULL, NULL, '605', '605', NULL, '4XL', 94.00, 125.00, 6, 1, '2025-11-09 16:51:40', '2025-11-09 16:51:40', '4XL لونج شورت اوليف حريمى'),
(25, NULL, NULL, '603', '603', NULL, '6X', 102.00, 135.00, 6, 1, '2025-11-09 16:53:18', '2025-11-09 16:53:18', '6XL  لونج شورت اوليف حريمى '),
(26, NULL, NULL, '608', '608', NULL, '2X', 99.00, 140.00, 6, 1, '2025-11-09 16:55:22', '2025-11-09 16:55:22', '2X برودا اوليف حريمى '),
(27, NULL, NULL, '609', '609', NULL, '3x', 107.00, 145.00, 6, 1, '2025-11-09 16:59:48', '2025-11-09 16:59:48', '3X برمودا اوليف حريمى '),
(28, NULL, NULL, '610', '610', NULL, '4x', 110.00, 150.00, 6, 1, '2025-11-09 17:02:10', '2025-11-09 17:02:10', '4X برمودا اوليف حريمى '),
(29, NULL, NULL, '613', '613', NULL, '2x', 122.00, 170.00, 6, 2, '2025-11-09 17:05:42', '2025-11-09 17:10:02', '2X استرتش اوليف حريمى '),
(30, NULL, NULL, '614', '614', NULL, '3x', 124.00, 175.00, 6, 1, '2025-11-09 17:06:42', '2025-11-09 17:09:41', '3X استرتش اوليف حريمى '),
(31, NULL, NULL, '615', '615', NULL, '4x', 133.00, 185.00, 6, 1, '2025-11-09 17:10:53', '2025-11-09 17:19:24', '4X استرتش اوليف حريمى '),
(32, NULL, NULL, '616', '616', NULL, '5x', 132.00, 190.00, 6, 1, '2025-11-09 17:11:45', '2025-11-09 17:19:49', '5X استرتش اوليف حريمى '),
(33, NULL, NULL, '617', '617', NULL, '6x', 137.00, 200.00, 6, 1, '2025-11-09 17:12:45', '2025-11-09 17:20:09', '6X استرتش اوليف حريمى '),
(34, NULL, NULL, '1', '1', NULL, 'L', 300.00, 400.00, 4, 1, '2025-11-09 17:23:39', '2025-11-09 17:25:43', 'دفايه مونايزا رجالي'),
(35, NULL, NULL, '2', '2', '--', 'XL', 310.00, 410.00, 4, 1, '2025-11-09 17:26:47', '2025-11-09 17:26:47', 'دفاية موناليزا XL'),
(37, NULL, NULL, '3', '3', NULL, '2XL', 320.00, 420.00, 4, 1, '2025-11-09 17:30:04', '2025-11-09 17:30:04', '2XLرجالي دفاية موناليزا'),
(38, NULL, NULL, '4', '4', NULL, '3XL', 330.00, 430.00, 4, 1, '2025-11-09 17:31:27', '2025-11-09 17:31:27', '3XL دفاية موناليزا رجالي'),
(39, NULL, NULL, '5', '5', NULL, '4XL', 340.00, 440.00, 4, 1, '2025-11-09 17:33:31', '2025-11-09 17:33:31', '4XL دفاية موناليزا رجالي'),
(42, NULL, NULL, '420', '420', NULL, 'L', 65.00, 95.00, 6, 1, '2025-11-09 17:47:53', '2025-11-09 17:47:53', 'L توب حماله عريضه اوليف  '),
(43, NULL, NULL, '421', '421', NULL, 'XL', 70.00, 100.00, 6, 1, '2025-11-09 17:49:50', '2025-11-09 17:49:50', 'XL توب حماله عريض اولييف'),
(44, NULL, NULL, '422', '422', NULL, '2XL', 73.00, 105.00, 3, 0, '2025-11-09 17:51:17', '2025-11-09 17:51:17', '2XL توب حمالة عريض '),
(45, NULL, NULL, '423', '423', NULL, '3XL', 77.00, 110.00, 3, 1, '2025-11-09 17:53:14', '2025-11-09 17:53:14', '3XL توب حمالة عريض '),
(46, NULL, NULL, '427', '427', NULL, '4XL', 80.00, 120.00, 6, 1, '2025-11-09 17:55:26', '2025-11-09 17:55:26', '4XL توب حمالة عريض'),
(47, NULL, NULL, '6060', '6060', NULL, '4', 230.00, 290.00, 3, 1, '2025-11-09 18:03:03', '2025-11-09 18:03:03', 'تيشرت اطفال مقاس4 '),
(48, NULL, NULL, '226', '226', '-', '-', 210.00, 270.00, 2, 1, '2025-11-09 18:07:13', '2025-11-09 18:07:13', 'ريد لاين شتوي'),
(49, NULL, NULL, '227', '227', NULL, NULL, 210.00, 270.00, 2, 1, '2025-11-09 18:08:42', '2025-11-09 18:08:42', 'ريد لاين شتوي'),
(50, NULL, NULL, '428', '428', NULL, NULL, 335.00, 395.00, 2, 0, '2025-11-09 18:11:33', '2025-11-09 19:04:33', 'ريد لاين شتوي موديل 428'),
(51, NULL, NULL, '955', '955', NULL, NULL, 385.00, 440.00, 1, 0, '2025-11-09 18:16:57', '2025-11-09 18:16:57', 'اونلي شتوي'),
(52, NULL, NULL, '439', '439', NULL, NULL, 395.00, 450.00, 1, 0, '2025-11-09 18:18:43', '2025-11-09 18:18:43', 'ريد لاين شتوي'),
(53, NULL, NULL, '2030', '2030', NULL, NULL, 265.00, 330.00, 2, 0, '2025-11-09 18:21:20', '2025-11-09 18:21:20', 'كارو ليد شتوي'),
(54, NULL, NULL, '202', '202', NULL, NULL, 430.00, 470.00, 2, 0, '2025-11-09 18:24:12', '2025-11-09 18:24:12', 'فورتيكا شتوي'),
(55, NULL, NULL, '2072', '2072', NULL, NULL, 240.00, 285.00, 4, 0, '2025-11-09 18:27:00', '2025-11-09 18:27:00', 'لين تيشرت بناتي'),
(56, NULL, NULL, '1230', '1230', NULL, NULL, 510.00, 575.00, 4, 0, '2025-11-09 18:30:15', '2025-11-09 18:30:15', 'هودي ظنط اولاد'),
(57, NULL, NULL, '505', '505', NULL, NULL, 450.00, 540.00, 2, 0, '2025-11-09 18:32:47', '2025-11-09 18:32:47', 'جاكيت ظنط كاريزما'),
(58, NULL, NULL, '010', '010', NULL, NULL, 550.00, 630.00, 2, 0, '2025-11-09 18:34:57', '2025-11-09 18:34:57', 'جاكيت اولادي اكس لانس'),
(59, NULL, NULL, '101', '101', NULL, NULL, 480.00, 560.00, 2, 0, '2025-11-09 18:37:26', '2025-11-09 18:37:26', 'جاكيت اولادي ظنط فورتيكا'),
(60, NULL, NULL, '825', '825', NULL, NULL, 420.00, 480.00, 1, 0, '2025-11-09 18:41:24', '2025-11-09 18:41:24', 'اونلي بناتي'),
(61, NULL, NULL, '437', '437', NULL, NULL, 437.00, 490.00, 1, 0, '2025-11-09 18:42:53', '2025-11-09 18:42:53', 'ريد لاين بناتي'),
(62, NULL, NULL, '065', '065', NULL, NULL, 425.00, 490.00, 2, 0, '2025-11-09 18:48:59', '2025-11-09 18:48:59', 'فرايز تريننج اولاد سوفت وسط'),
(63, NULL, NULL, '075', '075', NULL, NULL, 460.00, 530.00, 1, 0, '2025-11-09 18:51:45', '2025-11-09 18:51:45', 'فريز ترنج اولاد سوفت محير'),
(64, NULL, NULL, '127', '127', NULL, NULL, 210.00, 290.00, 2, 0, '2025-11-09 18:54:57', '2025-11-09 18:54:57', 'ريد لاين بناتي'),
(65, NULL, NULL, '214', '214', NULL, NULL, 435.00, 436.00, 1, 0, '2025-11-09 18:56:23', '2025-11-09 18:56:23', 'ريد لاين اولادي '),
(66, NULL, NULL, '400', '400', NULL, NULL, 335.00, 390.00, 2, 0, '2025-11-09 18:58:59', '2025-11-09 18:58:59', 'ريد لاين بناتي'),
(67, NULL, NULL, '555', '555', NULL, 'M', 350.00, 480.00, 6, 1, '2025-11-10 12:54:58', '2025-11-10 12:54:58', 'M طقم بوكسر جولد مقاس '),
(68, NULL, NULL, '556', '556', NULL, 'L', 365.00, 490.00, 6, 1, '2025-11-10 12:59:30', '2025-11-10 12:59:30', 'L طقم بوكسر جولد مقاس '),
(69, NULL, NULL, '557', '557', NULL, 'XL', 380.00, 505.00, 6, 1, '2025-11-10 13:01:03', '2025-11-10 13:01:03', 'XL طقم بوكسر جولد مقاس '),
(70, NULL, NULL, '558', '558', NULL, '2XL', 395.00, 515.00, 6, 1, '2025-11-10 13:02:52', '2025-11-10 13:02:52', '2XL طقم بوكسر جولد مقاس '),
(71, NULL, NULL, '559', '559', NULL, '3XL ', 410.00, 520.00, 6, 1, '2025-11-10 13:04:17', '2025-11-10 13:04:17', '3XL طقم بوكسر جولد مقاس '),
(72, NULL, NULL, '1001', '1001', NULL, 'XL ', 59.00, 90.00, 12, 1, '2025-11-10 13:09:22', '2025-11-10 13:11:50', 'XL نص كم عثمان'),
(73, NULL, NULL, '1002', '1002', NULL, '2XL ', 64.00, 95.00, 12, 1, '2025-11-10 13:11:02', '2025-11-10 13:11:02', '2XL نص كم عثمان'),
(74, NULL, NULL, '1003', '1003', NULL, '3XL ', 68.00, 100.00, 12, 1, '2025-11-10 13:12:50', '2025-11-10 13:12:50', '3XL نص كم عثمان'),
(75, NULL, NULL, '1004', '1004', NULL, '4XL ', 74.00, 105.00, 12, 1, '2025-11-10 13:13:53', '2025-11-10 13:13:53', '4XL نص كم عثمان'),
(76, NULL, NULL, '1005', '1005', NULL, 'M ', 43.00, 55.00, 12, 1, '2025-11-10 13:19:02', '2025-11-10 13:19:02', 'M حماله عثمان مقاس '),
(77, NULL, NULL, '1006', '1006', NULL, 'L ', 44.00, 60.00, 12, 1, '2025-11-10 13:20:13', '2025-11-10 13:20:13', 'L حماله عثمان مقاس '),
(78, NULL, NULL, '1007', '1007', NULL, 'XL', 46.00, 65.00, 12, 1, '2025-11-10 13:21:17', '2025-11-10 13:21:17', 'XL حماله عثمان مقاس '),
(79, NULL, NULL, '1008', '1008', NULL, '2XL ', 48.00, 70.00, 12, 1, '2025-11-10 13:22:17', '2025-11-10 13:22:17', '2XL حماله عثمان مقاس '),
(80, NULL, NULL, '1009', '1009', NULL, '3XL ', 49.00, 75.00, 12, 1, '2025-11-10 13:24:40', '2025-11-10 13:24:40', '3XL حماله عثمان مقاس '),
(81, NULL, NULL, '1010', '1010', NULL, '4XL ', 53.00, 80.00, 12, 1, '2025-11-10 13:25:51', '2025-11-10 13:25:51', '4XL حماله عثمان مقاس '),
(82, NULL, NULL, '1011', '1011', NULL, 'S ', 45.00, 65.00, 12, 1, '2025-11-10 14:07:46', '2025-11-10 14:07:46', 'S شورت عثمان مقاس '),
(83, NULL, NULL, '1012', '1012', NULL, 'L ', 47.00, 70.00, 12, 1, '2025-11-10 14:09:12', '2025-11-10 14:09:12', 'L شورت عثمان مقاس '),
(84, NULL, NULL, '1013', '1013', NULL, 'XL ', 52.00, 75.00, 12, 1, '2025-11-10 14:11:42', '2025-11-10 14:11:42', 'XL شورت عثمان مقاس '),
(85, NULL, NULL, '1014', '1014', NULL, '2XL ', 55.00, 80.00, 12, 1, '2025-11-10 14:13:06', '2025-11-10 14:13:06', '2XL شورت عثمان مقاس '),
(86, NULL, NULL, '1015', '1015', NULL, '3XL ', 57.00, 80.00, 12, 1, '2025-11-10 14:14:29', '2025-11-10 14:14:29', '3XL شورت عثمان مقاس '),
(87, NULL, NULL, '1017', '1017', NULL, 'M', 47.00, 65.00, 12, 1, '2025-11-10 14:21:03', '2025-11-10 14:21:03', 'M شورت عثمان مقاس '),
(88, NULL, NULL, '1018', '1018', NULL, 'M ', 47.00, 60.00, 12, 1, '2025-11-10 14:24:51', '2025-11-10 14:24:51', 'M بوكسر عثمان 3 قطعة'),
(89, NULL, NULL, '1019', '1019', NULL, 'L ', 49.00, 65.00, 12, 1, '2025-11-10 14:30:08', '2025-11-10 14:30:08', 'L بوكسر عثمان 1 قطعة مقاس'),
(90, NULL, NULL, '1020', '1020', NULL, 'XL ', 150.00, 210.00, 4, 1, '2025-11-10 14:32:36', '2025-11-10 14:35:47', 'XL بوكسر عثمان 3قطعة مقاس'),
(91, NULL, NULL, '1021', '1021', NULL, '2XL ', 155.00, 225.00, 4, 1, '2025-11-10 14:33:36', '2025-11-10 14:36:44', '2XL بوكسر عثمان 3قطعة مقاس'),
(92, NULL, NULL, '1022', '1022', NULL, '3XL ', 160.00, 240.00, 4, 1, '2025-11-10 14:38:24', '2025-11-10 14:38:24', '3XL بوكسر عثمان 3قطعة مقاس'),
(93, NULL, NULL, '1023', '1023', NULL, 'L', 290.00, 370.00, 2, 0, '2025-11-10 14:42:31', '2025-11-10 14:42:31', 'L طقم الوان عثمان شورت مقاس'),
(94, NULL, NULL, '1024', '1024', NULL, 'XL ', 300.00, 400.00, 2, 1, '2025-11-10 14:43:39', '2025-11-10 14:43:39', 'XL طقم الوان عثمان شورت مقاس'),
(95, NULL, NULL, '1025', '1025', NULL, '2XL ', 330.00, 430.00, 2, 1, '2025-11-10 14:45:07', '2025-11-10 14:45:07', '2XL طقم الوان عثمان شورت مقاس'),
(96, NULL, NULL, '1026', '1026', NULL, '3XL ', 350.00, 460.00, 2, 1, '2025-11-10 14:46:24', '2025-11-10 14:46:24', '3XL طقم الوان عثمان شورت مقاس'),
(97, NULL, NULL, '1027', '1027', NULL, 'M', 300.00, 390.00, 2, 1, '2025-11-10 14:48:41', '2025-11-10 14:48:41', 'Mطقم الوان موناليزا شورت مقاس'),
(98, NULL, NULL, '1028', '1028', NULL, 'L', 310.00, 410.00, 2, 1, '2025-11-10 14:49:43', '2025-11-10 14:49:43', 'L طقم الوان موناليزا شورت مقاس'),
(99, NULL, NULL, '1029', '1029', NULL, 'XL ', 320.00, 420.00, 2, 1, '2025-11-10 14:50:41', '2025-11-10 14:50:41', 'XL طقم الوان موناليزا شورت مقاس'),
(100, NULL, NULL, '1030', '1030', NULL, '3XL ', 330.00, 430.00, 2, 1, '2025-11-10 14:53:12', '2025-11-10 14:53:12', '3XL طقم الوان موناليزا شورت مقاس'),
(101, NULL, NULL, '1031', '1031', NULL, '2,4,6', 149.00, 180.00, 23, 3, '2025-11-10 15:02:12', '2025-11-10 15:02:12', '2,4,6 دفاية موناليزا ولادى وبناتى مقاس'),
(102, NULL, NULL, '1032', '1032', NULL, '8,10,12  ', 170.00, 200.00, 22, 3, '2025-11-10 15:06:04', '2025-11-10 15:06:04', '8,10,12  دفاية موناليزا ولادى وبناتى مقاس'),
(103, NULL, NULL, '1033', '1033', NULL, '14 , 16', 185.00, 230.00, 14, 3, '2025-11-10 15:08:44', '2025-11-10 15:08:44', '14 , 16 دفاية موناليزا ولادى وبناتى مقاس'),
(104, NULL, NULL, '1034', '1034', NULL, 'L ', 300.00, 370.00, 4, 1, '2025-11-10 15:13:13', '2025-11-10 15:13:13', 'L دفاية موناليزا حريمى مقاس'),
(105, NULL, NULL, '1035', '1035', NULL, 'XL ', 310.00, 380.00, 4, 1, '2025-11-10 15:14:23', '2025-11-10 15:14:23', 'XL دفاية موناليزا حريمى مقاس'),
(106, NULL, NULL, '1036', '1036', NULL, '2XL ', 320.00, 390.00, 4, 1, '2025-11-10 15:18:10', '2025-11-10 15:18:10', '2XL دفاية موناليزا حريمى مقاس'),
(107, NULL, NULL, '1037', '1037', NULL, '3XL ', 330.00, 400.00, 2, 1, '2025-11-10 15:19:28', '2025-11-10 15:19:28', '3XL دفاية موناليزا حريمى مقاس'),
(108, NULL, NULL, '1038', '1038', NULL, '4XL', 340.00, 400.00, 4, 1, '2025-11-10 15:21:36', '2025-11-10 15:21:36', '4XL دفاية موناليزا حريمى مقاس'),
(109, NULL, NULL, '1039', '1039', NULL, '5XL ', 350.00, 430.00, 2, 1, '2025-11-10 15:24:00', '2025-11-10 15:24:00', '5XL دفاية موناليزا حريمى مقاس'),
(110, NULL, NULL, '2000', '2000', NULL, 'M', 46.00, 65.00, 12, 2, '2025-11-10 15:32:03', '2025-11-10 15:32:03', 'M حمالة موناليزا ابيض مقاس '),
(111, NULL, NULL, '2001', '2001', NULL, 'L', 49.00, 70.00, 12, 1, '2025-11-10 15:33:14', '2025-11-10 15:33:14', 'Lحمالة موناليزا ابيض مقاس '),
(112, NULL, NULL, '2002', '2002', NULL, 'XL ', 51.00, 75.00, 12, 1, '2025-11-10 15:34:28', '2025-11-10 15:34:28', 'XL حمالة موناليزا ابيض مقاس '),
(113, NULL, NULL, '2003', '2003', NULL, '2XL ', 54.00, 80.00, 12, 2, '2025-11-10 15:35:40', '2025-11-10 15:35:40', '2XL حمالة موناليزا ابيض مقاس '),
(114, NULL, NULL, '2004', '2004', NULL, '3XL ', 56.00, 85.00, 12, 2, '2025-11-10 15:36:51', '2025-11-10 15:36:51', '3XL حمالة موناليزا ابيض مقاس '),
(115, NULL, NULL, '2005', '2005', NULL, '4XL ', 59.00, 90.00, 12, 2, '2025-11-10 15:37:59', '2025-11-10 15:37:59', '4XL حمالة موناليزا ابيض مقاس '),
(116, NULL, NULL, '2006', '2006', NULL, 'M', 50.00, 70.00, 12, 2, '2025-11-10 15:39:26', '2025-11-10 15:39:26', 'M شورت موناليزا ابيض مقاس '),
(117, NULL, NULL, '2007', '2007', NULL, 'L', 55.00, 75.00, 12, 2, '2025-11-10 15:40:38', '2025-11-10 15:40:38', 'L شورت موناليزا ابيض مقاس '),
(118, NULL, NULL, '2008', '2008', NULL, 'XL', 55.00, 80.00, 12, 2, '2025-11-10 15:45:01', '2025-11-10 15:45:01', 'XL شورت موناليزا ابيض مقاس '),
(119, NULL, NULL, '2009', '2009', NULL, '2XL ', 58.00, 85.00, 12, 2, '2025-11-10 15:46:29', '2025-11-10 15:46:29', '2XL شورت موناليزا ابيض مقاس '),
(120, NULL, NULL, '2010', '2010', NULL, '3XL ', 60.00, 90.00, 12, 2, '2025-11-10 15:47:49', '2025-11-10 15:47:49', '3XL شورت موناليزا ابيض مقاس '),
(121, NULL, NULL, '2011', '2011', NULL, '4XL ', 62.50, 95.00, 12, 1, '2025-11-10 15:48:42', '2025-11-10 15:48:42', '4XL شورت موناليزا ابيض مقاس '),
(122, NULL, NULL, '2012', '2012', NULL, 'L', 64.00, 93.00, 12, 2, '2025-11-10 15:52:44', '2025-11-10 15:52:44', 'L نص كم موناليزا ابيض مقاس'),
(123, NULL, NULL, '2013', '2013', NULL, '2XL ', 66.60, 100.00, 12, 2, '2025-11-10 15:53:51', '2025-11-10 15:53:51', '2XL نص كم موناليزا ابيض مقاس'),
(124, NULL, NULL, '2014', '2014', NULL, '3XL ', 71.00, 110.00, 12, 2, '2025-11-10 15:55:27', '2025-11-10 15:55:27', '3XL نص كم موناليزا ابيض مقاس'),
(125, NULL, NULL, '2015', '2015', NULL, '4XL ', 74.00, 115.00, 12, 2, '2025-11-10 15:58:14', '2025-11-10 15:58:14', '4XL نص كم موناليزا ابيض مقاس'),
(126, NULL, NULL, '1225', '1225', NULL, 'M', 241.00, 300.00, 6, 1, '2025-11-10 16:03:36', '2025-11-10 16:03:36', 'M طقم بوكسر رجالى مقاس '),
(127, NULL, NULL, '1226', '1226', NULL, NULL, 252.00, 310.00, 6, 2, '2025-11-10 16:05:53', '2025-11-10 16:05:53', 'L طقم بوكسر رجالى مقاس '),
(128, NULL, NULL, '1227', '1227', NULL, 'XL ', 264.00, 325.00, 6, 2, '2025-11-10 16:06:57', '2025-11-10 16:06:57', 'XL طقم بوكسر رجالى مقاس '),
(129, NULL, NULL, '1228', '1228', NULL, '2XL ', 280.00, 335.00, 6, 2, '2025-11-10 16:08:18', '2025-11-10 16:08:18', '2XL طقم بوكسر رجالى مقاس '),
(130, NULL, NULL, '1229', '1229', NULL, '3XL ', 298.00, 350.00, 6, 2, '2025-11-10 16:11:28', '2025-11-10 16:11:28', '3XL طقم بوكسر رجالى مقاس '),
(131, NULL, NULL, '1231', '1231', NULL, '4XL ', 312.00, 370.00, 6, 1, '2025-11-10 16:13:16', '2025-11-10 16:13:16', '4XL طقم بوكسر رجالى مقاس '),
(132, NULL, NULL, '1132', '1132', NULL, NULL, 188.00, 250.00, 4, 0, '2025-11-10 16:17:35', '2025-11-10 16:17:35', 'M طقم بوكسر رجالى101 مقاس '),
(133, NULL, NULL, '1133', '1133', NULL, 'L', 191.00, 255.00, 4, 1, '2025-11-10 16:18:34', '2025-11-10 16:18:34', 'L طقم بوكسر رجالى101 مقاس '),
(134, NULL, NULL, '1134', '1134', NULL, 'XL ', 200.00, 260.00, 4, 1, '2025-11-10 16:20:17', '2025-11-10 16:20:17', 'XL بوكسر رجالى101 مقاس '),
(135, NULL, NULL, '1135', '1135', NULL, '2XL ', 210.00, 270.00, 4, 1, '2025-11-10 16:21:13', '2025-11-10 16:21:13', '2XL بوكسر رجالى101 مقاس '),
(136, NULL, NULL, '1136', '1136', NULL, '3XL', 224.00, 280.00, 4, 1, '2025-11-10 16:22:14', '2025-11-10 16:22:14', '3XL بوكسر رجالى101 مقاس '),
(137, NULL, NULL, '1137', '1137', NULL, '4XL ', 229.00, 290.00, 4, 1, '2025-11-10 16:23:05', '2025-11-10 16:23:05', '4XL بوكسر رجالى101 مقاس ');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `product_variants`
--
ALTER TABLE `product_variants`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `product_variants_sku_unique` (`sku`),
  ADD UNIQUE KEY `product_variants_barcode_unique` (`barcode`),
  ADD KEY `product_variants_product_id_foreign` (`product_id`),
  ADD KEY `product_variants_supplier_id_index` (`supplier_id`),
  ADD KEY `product_variants_price_index` (`price`),
  ADD KEY `product_variants_stock_qty_index` (`stock_qty`),
  ADD KEY `product_variants_reorder_level_index` (`reorder_level`),
  ADD KEY `product_variants_is_low_stock_index` (`is_low_stock`),
  ADD KEY `idx_supplier_id` (`supplier_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `product_variants`
--
ALTER TABLE `product_variants`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=138;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `product_variants`
--
ALTER TABLE `product_variants`
  ADD CONSTRAINT `product_variants_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `product_variants_supplier_id_foreign` FOREIGN KEY (`supplier_id`) REFERENCES `suppliers` (`id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
