-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Nov 09, 2025 at 09:38 PM
-- Server version: 8.0.30
-- PHP Version: 8.4.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `pos-clothes`
--

-- --------------------------------------------------------

--
-- Table structure for table `product_variants`
--

CREATE TABLE `product_variants` (
  `id` bigint UNSIGNED NOT NULL,
  `product_id` bigint UNSIGNED DEFAULT NULL,
  `supplier_id` bigint UNSIGNED DEFAULT NULL,
  `sku` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `barcode` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `color` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `size` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `cost` decimal(10,2) NOT NULL DEFAULT '0.00',
  `price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `stock_qty` int NOT NULL DEFAULT '0',
  `reorder_level` int NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_low_stock` tinyint(1) GENERATED ALWAYS AS ((`stock_qty` < `reorder_level`)) STORED
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_variants`
--

INSERT INTO `product_variants` (`id`, `product_id`, `supplier_id`, `sku`, `barcode`, `color`, `size`, `cost`, `price`, `stock_qty`, `reorder_level`, `created_at`, `updated_at`, `name`) VALUES
(1, NULL, NULL, '102', '102', '--', '40', 214.00, 270.00, 4, 1, '2025-11-09 15:10:44', '2025-11-09 15:30:08', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(2, NULL, NULL, '103', '103', '--', '38', 208.00, 260.00, 6, 1, '2025-11-09 15:34:29', '2025-11-09 15:34:29', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(3, NULL, NULL, '104', '104', NULL, '36', 99.00, 250.00, 5, 1, '2025-11-09 15:43:22', '2025-11-09 16:41:38', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(4, NULL, NULL, '105', '105', NULL, '34', 193.00, 210.00, 6, 1, '2025-11-09 15:50:38', '2025-11-09 15:50:38', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(5, NULL, NULL, '106', '106', NULL, '14', 187.00, 210.00, 6, 1, '2025-11-09 15:53:40', '2025-11-09 15:53:40', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(7, NULL, NULL, '107', '107', NULL, '12', 176.00, 210.00, 6, 1, '2025-11-09 15:58:36', '2025-11-09 15:58:36', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(8, NULL, NULL, '108', '108', NULL, '10', 167.00, 200.00, 6, 1, '2025-11-09 16:00:05', '2025-11-09 16:00:05', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(9, NULL, NULL, '109', '109', NULL, '8', 160.00, 200.00, 6, 1, '2025-11-09 16:03:21', '2025-11-09 16:03:21', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(10, NULL, NULL, '110', '110', NULL, '6', 150.00, 200.00, 6, 1, '2025-11-09 16:05:55', '2025-11-09 16:05:55', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(11, NULL, NULL, '111', '111', NULL, '4', 144.00, 200.00, 6, 1, '2025-11-09 16:10:07', '2025-11-09 16:10:07', 'طقم بوكسر اولاد 2 قطعة اوليف'),
(12, NULL, NULL, '315', '315', NULL, '4', 195.00, 270.00, 6, 1, '2025-11-09 16:19:01', '2025-11-09 16:19:01', 'طقم بوكسر بناتى 3 قطعة اوليف'),
(13, NULL, NULL, '316', '316', NULL, '6', 209.00, 280.00, 6, 1, '2025-11-09 16:20:57', '2025-11-09 16:20:57', 'طقم بوكسر بناتى3 قطعة اوليف'),
(14, NULL, NULL, '317', '317', NULL, '8', 219.00, 290.00, 6, 1, '2025-11-09 16:22:39', '2025-11-09 16:31:32', 'طقم بوكسر بناتى3 قطعة اوليف'),
(15, NULL, NULL, '318', '318', NULL, '10', 231.00, 310.00, 6, 1, '2025-11-09 16:29:28', '2025-11-09 16:29:28', 'طقم بوكسر بناتى3 قطعة اوليف'),
(16, NULL, NULL, '319', '319', NULL, '12', 243.00, 320.00, 6, 1, '2025-11-09 16:34:01', '2025-11-09 16:34:01', 'طقم بوكسر بناتى3 قطعة اوليف'),
(17, NULL, NULL, '320', '320', NULL, '14', 250.00, 330.00, 4, 1, '2025-11-09 16:36:44', '2025-11-09 16:36:44', 'طقم بوكسر بناتى3 قطعة اوليف'),
(18, NULL, NULL, '321', '321', NULL, '34', 267.00, 345.00, 4, 1, '2025-11-09 16:38:27', '2025-11-09 16:38:27', 'طقم بوكسر بناتى3 قطعة اوليف'),
(19, NULL, NULL, '322', '322', NULL, '36', 276.00, 355.00, 4, 1, '2025-11-09 16:39:34', '2025-11-09 16:39:34', 'طقم بوكسر بناتى3 قطعة اوليف'),
(20, NULL, NULL, '323', '323', NULL, '38', 291.00, 370.00, 4, 1, '2025-11-09 16:40:59', '2025-11-09 16:40:59', 'طقم بوكسر بناتى3 قطعة اوليف'),
(21, NULL, NULL, '324', '324', NULL, '40', 302.00, 400.00, 4, 1, '2025-11-09 16:42:44', '2025-11-09 16:42:44', 'طقم بوكسر بناتى3 قطعة اوليف'),
(22, NULL, NULL, '607', '607', NULL, '2XL', 86.00, 115.00, 3, 1, '2025-11-09 16:46:40', '2025-11-09 16:46:40', 'لونج شورت اوليف حريمى'),
(23, NULL, NULL, '606', '606', NULL, '3XL', 88.00, 120.00, 6, 1, '2025-11-09 16:48:18', '2025-11-09 16:48:18', 'لونج شورت اوليف حريمى'),
(24, NULL, NULL, '605', '605', NULL, '4XL', 94.00, 125.00, 6, 1, '2025-11-09 16:51:40', '2025-11-09 16:51:40', '4XL لونج شورت اوليف حريمى'),
(25, NULL, NULL, '603', '603', NULL, '6X', 102.00, 135.00, 6, 1, '2025-11-09 16:53:18', '2025-11-09 16:53:18', '6XL  لونج شورت اوليف حريمى '),
(26, NULL, NULL, '608', '608', NULL, '2X', 99.00, 140.00, 6, 1, '2025-11-09 16:55:22', '2025-11-09 16:55:22', '2X برودا اوليف حريمى '),
(27, NULL, NULL, '609', '609', NULL, '3x', 107.00, 145.00, 6, 1, '2025-11-09 16:59:48', '2025-11-09 16:59:48', '3X برمودا اوليف حريمى '),
(28, NULL, NULL, '610', '610', NULL, '4x', 110.00, 150.00, 6, 1, '2025-11-09 17:02:10', '2025-11-09 17:02:10', '4X برمودا اوليف حريمى '),
(29, NULL, NULL, '613', '613', NULL, '2x', 122.00, 170.00, 6, 2, '2025-11-09 17:05:42', '2025-11-09 17:10:02', '2X استرتش اوليف حريمى '),
(30, NULL, NULL, '614', '614', NULL, '3x', 124.00, 175.00, 6, 1, '2025-11-09 17:06:42', '2025-11-09 17:09:41', '3X استرتش اوليف حريمى '),
(31, NULL, NULL, '615', '615', NULL, '4x', 133.00, 185.00, 6, 1, '2025-11-09 17:10:53', '2025-11-09 17:19:24', '4X استرتش اوليف حريمى '),
(32, NULL, NULL, '616', '616', NULL, '5x', 132.00, 190.00, 6, 1, '2025-11-09 17:11:45', '2025-11-09 17:19:49', '5X استرتش اوليف حريمى '),
(33, NULL, NULL, '617', '617', NULL, '6x', 137.00, 200.00, 6, 1, '2025-11-09 17:12:45', '2025-11-09 17:20:09', '6X استرتش اوليف حريمى '),
(34, NULL, NULL, '1', '1', NULL, 'L', 300.00, 400.00, 4, 1, '2025-11-09 17:23:39', '2025-11-09 17:25:43', 'دفايه مونايزا رجالي'),
(35, NULL, NULL, '2', '2', '--', 'XL', 310.00, 410.00, 4, 1, '2025-11-09 17:26:47', '2025-11-09 17:26:47', 'دفاية موناليزا XL'),
(37, NULL, NULL, '3', '3', NULL, '2XL', 320.00, 420.00, 4, 1, '2025-11-09 17:30:04', '2025-11-09 17:30:04', '2XLرجالي دفاية موناليزا'),
(38, NULL, NULL, '4', '4', NULL, '3XL', 330.00, 430.00, 4, 1, '2025-11-09 17:31:27', '2025-11-09 17:31:27', '3XL دفاية موناليزا رجالي'),
(39, NULL, NULL, '5', '5', NULL, '4XL', 340.00, 440.00, 4, 1, '2025-11-09 17:33:31', '2025-11-09 17:33:31', '4XL دفاية موناليزا رجالي'),
(42, NULL, NULL, '420', '420', NULL, 'L', 65.00, 95.00, 6, 1, '2025-11-09 17:47:53', '2025-11-09 17:47:53', 'L توب حماله عريضه اوليف  '),
(43, NULL, NULL, '421', '421', NULL, 'XL', 70.00, 100.00, 6, 1, '2025-11-09 17:49:50', '2025-11-09 17:49:50', 'XL توب حماله عريض اولييف'),
(44, NULL, NULL, '422', '422', NULL, '2XL', 73.00, 105.00, 3, 0, '2025-11-09 17:51:17', '2025-11-09 17:51:17', '2XL توب حمالة عريض '),
(45, NULL, NULL, '423', '423', NULL, '3XL', 77.00, 110.00, 3, 1, '2025-11-09 17:53:14', '2025-11-09 17:53:14', '3XL توب حمالة عريض '),
(46, NULL, NULL, '427', '427', NULL, '4XL', 80.00, 120.00, 6, 1, '2025-11-09 17:55:26', '2025-11-09 17:55:26', '4XL توب حمالة عريض'),
(47, NULL, NULL, '6060', '6060', NULL, '4', 230.00, 290.00, 3, 1, '2025-11-09 18:03:03', '2025-11-09 18:03:03', 'تيشرت اطفال مقاس4 '),
(48, NULL, NULL, '226', '226', '-', '-', 210.00, 270.00, 2, 1, '2025-11-09 18:07:13', '2025-11-09 18:07:13', 'ريد لاين شتوي'),
(49, NULL, NULL, '227', '227', NULL, NULL, 210.00, 270.00, 2, 1, '2025-11-09 18:08:42', '2025-11-09 18:08:42', 'ريد لاين شتوي'),
(50, NULL, NULL, '428', '428', NULL, NULL, 335.00, 395.00, 2, 0, '2025-11-09 18:11:33', '2025-11-09 19:04:33', 'ريد لاين شتوي موديل 428'),
(51, NULL, NULL, '955', '955', NULL, NULL, 385.00, 440.00, 1, 0, '2025-11-09 18:16:57', '2025-11-09 18:16:57', 'اونلي شتوي'),
(52, NULL, NULL, '439', '439', NULL, NULL, 395.00, 450.00, 1, 0, '2025-11-09 18:18:43', '2025-11-09 18:18:43', 'ريد لاين شتوي'),
(53, NULL, NULL, '2030', '2030', NULL, NULL, 265.00, 330.00, 2, 0, '2025-11-09 18:21:20', '2025-11-09 18:21:20', 'كارو ليد شتوي'),
(54, NULL, NULL, '202', '202', NULL, NULL, 430.00, 470.00, 2, 0, '2025-11-09 18:24:12', '2025-11-09 18:24:12', 'فورتيكا شتوي'),
(55, NULL, NULL, '2072', '2072', NULL, NULL, 240.00, 285.00, 4, 0, '2025-11-09 18:27:00', '2025-11-09 18:27:00', 'لين تيشرت بناتي'),
(56, NULL, NULL, '1230', '1230', NULL, NULL, 510.00, 575.00, 4, 0, '2025-11-09 18:30:15', '2025-11-09 18:30:15', 'هودي ظنط اولاد'),
(57, NULL, NULL, '505', '505', NULL, NULL, 450.00, 540.00, 2, 0, '2025-11-09 18:32:47', '2025-11-09 18:32:47', 'جاكيت ظنط كاريزما'),
(58, NULL, NULL, '010', '010', NULL, NULL, 550.00, 630.00, 2, 0, '2025-11-09 18:34:57', '2025-11-09 18:34:57', 'جاكيت اولادي اكس لانس'),
(59, NULL, NULL, '101', '101', NULL, NULL, 480.00, 560.00, 2, 0, '2025-11-09 18:37:26', '2025-11-09 18:37:26', 'جاكيت اولادي ظنط فورتيكا'),
(60, NULL, NULL, '825', '825', NULL, NULL, 420.00, 480.00, 1, 0, '2025-11-09 18:41:24', '2025-11-09 18:41:24', 'اونلي بناتي'),
(61, NULL, NULL, '437', '437', NULL, NULL, 437.00, 490.00, 1, 0, '2025-11-09 18:42:53', '2025-11-09 18:42:53', 'ريد لاين بناتي'),
(62, NULL, NULL, '065', '065', NULL, NULL, 425.00, 490.00, 2, 0, '2025-11-09 18:48:59', '2025-11-09 18:48:59', 'فرايز تريننج اولاد سوفت وسط'),
(63, NULL, NULL, '075', '075', NULL, NULL, 460.00, 530.00, 1, 0, '2025-11-09 18:51:45', '2025-11-09 18:51:45', 'فريز ترنج اولاد سوفت محير'),
(64, NULL, NULL, '127', '127', NULL, NULL, 210.00, 290.00, 2, 0, '2025-11-09 18:54:57', '2025-11-09 18:54:57', 'ريد لاين بناتي'),
(65, NULL, NULL, '214', '214', NULL, NULL, 435.00, 436.00, 1, 0, '2025-11-09 18:56:23', '2025-11-09 18:56:23', 'ريد لاين اولادي '),
(66, NULL, NULL, '400', '400', NULL, NULL, 335.00, 390.00, 2, 0, '2025-11-09 18:58:59', '2025-11-09 18:58:59', 'ريد لاين بناتي');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `product_variants`
--
ALTER TABLE `product_variants`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `product_variants_sku_unique` (`sku`),
  ADD UNIQUE KEY `product_variants_barcode_unique` (`barcode`),
  ADD KEY `product_variants_product_id_foreign` (`product_id`),
  ADD KEY `product_variants_supplier_id_index` (`supplier_id`),
  ADD KEY `product_variants_price_index` (`price`),
  ADD KEY `product_variants_stock_qty_index` (`stock_qty`),
  ADD KEY `product_variants_reorder_level_index` (`reorder_level`),
  ADD KEY `product_variants_is_low_stock_index` (`is_low_stock`),
  ADD KEY `idx_supplier_id` (`supplier_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `product_variants`
--
ALTER TABLE `product_variants`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `product_variants`
--
ALTER TABLE `product_variants`
  ADD CONSTRAINT `product_variants_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `product_variants_supplier_id_foreign` FOREIGN KEY (`supplier_id`) REFERENCES `suppliers` (`id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
